zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
/*
 * Copyright (c) 2025 STMicroelectronics.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <errno.h>

#include <stm32_bitops.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/drivers/video.h>
#include <zephyr/drivers/video/stm32_dcmipp.h>
#include <zephyr/dt-bindings/video/video-interfaces.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/video/video.h>

#include "video_common.h"

#define DT_DRV_COMPAT st_stm32_dcmipp

/* On STM32MP13X HAL, below two functions have different names */
#if defined(CONFIG_SOC_SERIES_STM32MP13X)
#define HAL_DCMIPP_PIPE_SetConfig HAL_DCMIPP_PIPE_Config
#define HAL_DCMIPP_PARALLEL_SetConfig HAL_DCMIPP_SetParallelConfig
#endif

#if defined(DCMIPP_SERIAL_MODE)
#define STM32_DCMIPP_HAS_CSI
#endif
#if defined(DCMIPP_PIPE1) && defined(DCMIPP_PIPE2)
#define STM32_DCMIPP_HAS_PIXEL_PIPES
#endif

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
/* Weak function declaration in order to interface with external ISP handler */
void __weak stm32_dcmipp_isp_vsync_update(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
}

int __weak stm32_dcmipp_isp_init(DCMIPP_HandleTypeDef *hdcmipp, const struct device *source)
{
	return 0;
}

int __weak stm32_dcmipp_isp_start(void)
{
	return 0;
}

int __weak stm32_dcmipp_isp_stop(void)
{
	return 0;
}
#endif

LOG_MODULE_REGISTER(stm32_dcmipp, CONFIG_VIDEO_LOG_LEVEL);

typedef void (*irq_config_func_t)(const struct device *dev);

enum stm32_dcmipp_state {
	STM32_DCMIPP_STOPPED = 0,
	STM32_DCMIPP_WAIT_FOR_BUFFER,
	STM32_DCMIPP_RUNNING,
};

#define STM32_DCMIPP_MAX_PIPE_NB	3

#define STM32_DCMIPP_MAX_ISP_DEC_FACTOR	8
#define STM32_DCMIPP_MAX_PIPE_DEC_FACTOR	8
#define STM32_DCMIPP_MAX_PIPE_DSIZE_FACTOR	8
#define STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR (STM32_DCMIPP_MAX_PIPE_DEC_FACTOR * \
					    STM32_DCMIPP_MAX_PIPE_DSIZE_FACTOR)
struct stm32_dcmipp_pipe_data {
	const struct device *dev;
	uint32_t id;
	struct stm32_dcmipp_data *dcmipp;
	struct k_mutex lock;
	struct video_format fmt;
	struct video_rect crop;
	struct video_rect compose;
	struct k_fifo fifo_in;
	struct k_fifo fifo_out;
	struct video_buffer *next;
	struct video_buffer *active;
	enum stm32_dcmipp_state state;
	bool is_streaming;
};

struct stm32_dcmipp_data {
	const struct device *dev;
	DCMIPP_HandleTypeDef hdcmipp;

	/* FIXME - there should be a mutex to protect enabled_pipe */
	unsigned int enabled_pipe;
	struct video_format source_fmt;

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	/* Store the ISP decimation block ratio */
	int32_t isp_dec_hratio;
	int32_t isp_dec_vratio;
#endif

	struct stm32_dcmipp_pipe_data *pipe[STM32_DCMIPP_MAX_PIPE_NB];
};

struct stm32_dcmipp_config {
	const struct stm32_pclken dcmipp_pclken;
	const struct stm32_pclken dcmipp_pclken_ker;
	const bool has_dcmipp_ker;
	irq_config_func_t irq_config;
	const struct pinctrl_dev_config *pctrl;
	const struct device *source_dev;
	const struct reset_dt_spec reset_dcmipp;
	int bus_type;
#if defined(STM32_DCMIPP_HAS_CSI)
	const struct stm32_pclken csi_pclken;
	const struct reset_dt_spec reset_csi;
	struct {
		uint32_t nb_lanes;
		uint8_t lanes[2];
	} csi;
#endif
	struct {
		uint32_t vs_polarity;
		uint32_t hs_polarity;
		uint32_t pck_polarity;
	} parallel;
};

#define STM32_DCMIPP_WIDTH_MIN	16
#define STM32_DCMIPP_HEIGHT_MIN	2
#define STM32_DCMIPP_WIDTH_MAX	4094
#define STM32_DCMIPP_HEIGHT_MAX	4094

#define VIDEO_Y_PLANE_PITCH(fmt)						\
	((VIDEO_FMT_IS_FULL_PLANAR(fmt->pixelformat) ||				\
	  VIDEO_FMT_IS_SEMI_PLANAR(fmt->pixelformat)) ?				\
	 (fmt)->width : (fmt)->pitch)

#define VIDEO_FMT_PLANAR_Y_PLANE_SIZE(fmt)	((fmt)->width * (fmt)->height)

static void stm32_dcmipp_set_next_buffer_addr(struct stm32_dcmipp_pipe_data *pipe)
{
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	struct video_format *fmt = &pipe->fmt;
#endif
	uint8_t *plane = pipe->next->buffer;

	/* TODO - the HAL is missing a SetMemoryAddress for auxiliary addresses */
	/* Update main buffer address */
	if (pipe->id == DCMIPP_PIPE0) {
		stm32_reg_write(&dcmipp->hdcmipp.Instance->P0PPM0AR1, (uint32_t)plane);
	}
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	else if (pipe->id == DCMIPP_PIPE1) {
		stm32_reg_write(&dcmipp->hdcmipp.Instance->P1PPM0AR1, (uint32_t)plane);
	} else {
		stm32_reg_write(&dcmipp->hdcmipp.Instance->P2PPM0AR1, (uint32_t)plane);
	}

	if (pipe->id != DCMIPP_PIPE1) {
		return;
	}

	if (VIDEO_FMT_IS_SEMI_PLANAR(fmt->pixelformat) ||
	    VIDEO_FMT_IS_FULL_PLANAR(fmt->pixelformat)) {
		/* Y plane has 8 bit per pixel, next plane is located at off + width * height */
		plane += VIDEO_FMT_PLANAR_Y_PLANE_SIZE(fmt);

		stm32_reg_write(&dcmipp->hdcmipp.Instance->P1PPM1AR1, (uint32_t)plane);

		if (VIDEO_FMT_IS_FULL_PLANAR(fmt->pixelformat)) {
			/* In case of YUV420 / YVU420, U plane has half width / half height */
			plane += VIDEO_FMT_PLANAR_Y_PLANE_SIZE(fmt) / 4;

			stm32_reg_write(&dcmipp->hdcmipp.Instance->P1PPM2AR1, (uint32_t)plane);
		}
	}
#endif
}

/* Callback getting called for each frame written into memory */
void HAL_DCMIPP_PIPE_FrameEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
	struct stm32_dcmipp_data *dcmipp =
			CONTAINER_OF(hdcmipp, struct stm32_dcmipp_data, hdcmipp);
	struct stm32_dcmipp_pipe_data *pipe = dcmipp->pipe[Pipe];
	HAL_StatusTypeDef hal_ret;
	uint32_t bytesused;

	__ASSERT(pipe->active, "Unexpected behavior, active_buf must not be NULL");

	/* Counter is only available on Pipe0 */
	if (Pipe == DCMIPP_PIPE0) {
		hal_ret = HAL_DCMIPP_PIPE_GetDataCounter(hdcmipp, Pipe, &bytesused);
		if (hal_ret != HAL_OK) {
			LOG_WRN("Failed to read counter - buffer in error");
			pipe->active->bytesused = 0;
		} else {
			pipe->active->bytesused = bytesused;
		}
	} else {
		pipe->active->bytesused = pipe->fmt.height * pipe->fmt.pitch;
	}

	pipe->active->timestamp = k_uptime_get_32();
	pipe->active->line_offset = 0;

	k_fifo_put(&pipe->fifo_out, pipe->active);
	pipe->active = NULL;
}

