zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
/* Callback getting called for each vsync */
void HAL_DCMIPP_PIPE_VsyncEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
	struct stm32_dcmipp_data *dcmipp =
			CONTAINER_OF(hdcmipp, struct stm32_dcmipp_data, hdcmipp);
	struct stm32_dcmipp_pipe_data *pipe = dcmipp->pipe[Pipe];

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	/*
	 * Let the external ISP handler know that a VSYNC happened a new statistics are
	 * thus available
	 */
	stm32_dcmipp_isp_vsync_update(hdcmipp, Pipe);
#endif

	if (pipe->state != STM32_DCMIPP_RUNNING) {
		return;
	}

	pipe->active = pipe->next;

	pipe->next = k_fifo_get(&pipe->fifo_in, K_NO_WAIT);
	if (pipe->next == NULL) {
		LOG_DBG("No buffer available, pause streaming");
		/*
		 * Disable Capture Request
		 * Use direct register access here since we don't want to wait until
		 * getting CPTACT down here since we still need to handle other stuff
		 */
		pipe->state = STM32_DCMIPP_WAIT_FOR_BUFFER;
		if (Pipe == DCMIPP_PIPE0) {
			stm32_reg_clear_bits(&hdcmipp->Instance->P0FCTCR, DCMIPP_P0FCTCR_CPTREQ);
		}
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
		else if (Pipe == DCMIPP_PIPE1) {
			stm32_reg_clear_bits(&hdcmipp->Instance->P1FCTCR, DCMIPP_P1FCTCR_CPTREQ);
		} else if (Pipe == DCMIPP_PIPE2) {
			stm32_reg_clear_bits(&hdcmipp->Instance->P2FCTCR, DCMIPP_P2FCTCR_CPTREQ);
		}
#endif
		return;
	}

	/* Update buffer address */
	stm32_dcmipp_set_next_buffer_addr(pipe);
}

#if defined(STM32_DCMIPP_HAS_CSI)
#define INPUT_FMT(fmt, dcmipp_fmt, bpp, dt)			\
	{							\
		.pixelformat = VIDEO_PIX_FMT_##fmt,		\
		.dcmipp_format = DCMIPP_FORMAT_##dcmipp_fmt,	\
		.dcmipp_csi_bpp = DCMIPP_CSI_DT_BPP##bpp,	\
		.dcmipp_csi_dt = DCMIPP_DT_##dt,		\
	}
#else
#define INPUT_FMT(fmt, dcmipp_fmt, bpp, dt)			\
	{							\
		.pixelformat = VIDEO_PIX_FMT_##fmt,		\
		.dcmipp_format = DCMIPP_FORMAT_##dcmipp_fmt,	\
	}
#endif

/* DCMIPP input format descriptions */
static const struct stm32_dcmipp_input_fmt {
	uint32_t pixelformat;
	uint32_t dcmipp_format;
#if defined(STM32_DCMIPP_HAS_CSI)
	uint32_t dcmipp_csi_bpp;
	uint32_t dcmipp_csi_dt;
#endif
} stm32_dcmipp_input_fmt_desc[] = {
	INPUT_FMT(SBGGR8, RAW8, 8, RAW8), INPUT_FMT(SGBRG8, RAW8, 8, RAW8),
	INPUT_FMT(SGRBG8, RAW8, 8, RAW8), INPUT_FMT(SRGGB8, RAW8, 8, RAW8),
	INPUT_FMT(GREY, RAW8, 8, RAW8),
	INPUT_FMT(SBGGR10P, RAW10, 10, RAW10), INPUT_FMT(SGBRG10P, RAW10, 10, RAW10),
	INPUT_FMT(SGRBG10P, RAW10, 10, RAW10), INPUT_FMT(SRGGB10P, RAW10, 10, RAW10),
	INPUT_FMT(SBGGR12P, RAW12, 12, RAW12), INPUT_FMT(SGBRG12P, RAW12, 12, RAW12),
	INPUT_FMT(SGRBG12P, RAW12, 12, RAW12), INPUT_FMT(SRGGB12P, RAW12, 12, RAW12),
	INPUT_FMT(SBGGR14P, RAW14, 14, RAW14), INPUT_FMT(SGBRG14P, RAW14, 14, RAW14),
	INPUT_FMT(SGRBG14P, RAW14, 14, RAW14), INPUT_FMT(SRGGB14P, RAW14, 14, RAW14),
	INPUT_FMT(RGB565, RGB565, 8, RGB565),
	INPUT_FMT(YUYV, YUV422, 8, YUV422_8),
};

static const struct stm32_dcmipp_input_fmt *stm32_dcmipp_get_input_info(uint32_t pixelformat)
{
	int i;

	for (i = 0; i < ARRAY_SIZE(stm32_dcmipp_input_fmt_desc); i++) {
		if (pixelformat == stm32_dcmipp_input_fmt_desc[i].pixelformat) {
			return &stm32_dcmipp_input_fmt_desc[i];
		}
	}

	return NULL;
}

static int stm32_dcmipp_conf_parallel(const struct device *dev,
				      const struct stm32_dcmipp_input_fmt *input_fmt)
{
	struct stm32_dcmipp_data *dcmipp = dev->data;
	const struct stm32_dcmipp_config *config = dev->config;
	DCMIPP_ParallelConfTypeDef parallel_cfg = { 0 };
	HAL_StatusTypeDef hal_ret;

	parallel_cfg.Format           = input_fmt->dcmipp_format;
	/*
	 * On parallel interface, the DCMIPP expects data in RGB565_BE, aka
	 *		D7 D6 D5 D4 D3 D2 D1 D0
	 *
	 * cycle 1:	R4 R3 R2 R1 R0 G5 G4 G3
	 * cycle 2:	G2 G1 G0 B4 B3 B2 B1 B0
	 *
	 * Use swapped cycle mode for RGB565 which correspond to the commonly
	 * used RGB565 LE, aka
	 *
	 *		D7 D6 D5 D4 D3 D2 D1 D0
	 *
	 * cycle 1:	G2 G1 G0 B4 B3 B2 B1 B0
	 * cycle 2:	R4 R3 R2 R1 R0 G5 G4 G3
	 */
	if (input_fmt->pixelformat == VIDEO_PIX_FMT_RGB565) {
		parallel_cfg.SwapCycles = DCMIPP_SWAPCYCLES_ENABLE;
	} else {
		parallel_cfg.SwapCycles = DCMIPP_SWAPCYCLES_DISABLE;
	}
	parallel_cfg.VSPolarity       = config->parallel.vs_polarity;
	parallel_cfg.HSPolarity       = config->parallel.hs_polarity;
	parallel_cfg.PCKPolarity      = config->parallel.pck_polarity;
	parallel_cfg.ExtendedDataMode = DCMIPP_INTERFACE_8BITS;
	parallel_cfg.SynchroMode      = DCMIPP_SYNCHRO_HARDWARE;

	/* There may be the case when HAL_DCMIPP_PARALLEL_SetConfig called second time
	 * so reset state so it doesn't fail
	 */
	dcmipp->hdcmipp.State = HAL_DCMIPP_STATE_INIT;
	hal_ret = HAL_DCMIPP_PARALLEL_SetConfig(&dcmipp->hdcmipp, &parallel_cfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to configure DCMIPP Parallel interface");
		return -EIO;
	}

	return 0;
}

#if defined(STM32_DCMIPP_HAS_CSI)
#define	DCMIPP_PHY_BITRATE(val)				\
	{						\
		.rate = val,				\
		.PHYBitrate = DCMIPP_CSI_PHY_BT_##val,	\
	}
static const struct {
	uint16_t rate;
	uint16_t PHYBitrate;
} stm32_dcmipp_bitrate[] = {
	DCMIPP_PHY_BITRATE(80), DCMIPP_PHY_BITRATE(90), DCMIPP_PHY_BITRATE(100),
	DCMIPP_PHY_BITRATE(110), DCMIPP_PHY_BITRATE(120), DCMIPP_PHY_BITRATE(130),
	DCMIPP_PHY_BITRATE(140), DCMIPP_PHY_BITRATE(150), DCMIPP_PHY_BITRATE(160),
	DCMIPP_PHY_BITRATE(170), DCMIPP_PHY_BITRATE(180), DCMIPP_PHY_BITRATE(190),
	DCMIPP_PHY_BITRATE(205), DCMIPP_PHY_BITRATE(220), DCMIPP_PHY_BITRATE(235),
	DCMIPP_PHY_BITRATE(250), DCMIPP_PHY_BITRATE(275), DCMIPP_PHY_BITRATE(300),
	DCMIPP_PHY_BITRATE(325), DCMIPP_PHY_BITRATE(350), DCMIPP_PHY_BITRATE(400),
	DCMIPP_PHY_BITRATE(450), DCMIPP_PHY_BITRATE(500), DCMIPP_PHY_BITRATE(550),
	DCMIPP_PHY_BITRATE(600), DCMIPP_PHY_BITRATE(650), DCMIPP_PHY_BITRATE(700),
	DCMIPP_PHY_BITRATE(750), DCMIPP_PHY_BITRATE(800), DCMIPP_PHY_BITRATE(850),
	DCMIPP_PHY_BITRATE(900), DCMIPP_PHY_BITRATE(950), DCMIPP_PHY_BITRATE(1000),
	DCMIPP_PHY_BITRATE(1050), DCMIPP_PHY_BITRATE(1100), DCMIPP_PHY_BITRATE(1150),
	DCMIPP_PHY_BITRATE(1200), DCMIPP_PHY_BITRATE(1250), DCMIPP_PHY_BITRATE(1300),
	DCMIPP_PHY_BITRATE(1350), DCMIPP_PHY_BITRATE(1400), DCMIPP_PHY_BITRATE(1450),
	DCMIPP_PHY_BITRATE(1500), DCMIPP_PHY_BITRATE(1550), DCMIPP_PHY_BITRATE(1600),
	DCMIPP_PHY_BITRATE(1650), DCMIPP_PHY_BITRATE(1700), DCMIPP_PHY_BITRATE(1750),
	DCMIPP_PHY_BITRATE(1800), DCMIPP_PHY_BITRATE(1850), DCMIPP_PHY_BITRATE(1900),
	DCMIPP_PHY_BITRATE(1950), DCMIPP_PHY_BITRATE(2000), DCMIPP_PHY_BITRATE(2050),
	DCMIPP_PHY_BITRATE(2100), DCMIPP_PHY_BITRATE(2150), DCMIPP_PHY_BITRATE(2200),
	DCMIPP_PHY_BITRATE(2250), DCMIPP_PHY_BITRATE(2300), DCMIPP_PHY_BITRATE(2350),
	DCMIPP_PHY_BITRATE(2400), DCMIPP_PHY_BITRATE(2450), DCMIPP_PHY_BITRATE(2500),
};

static int stm32_dcmipp_conf_csi(const struct device *dev, uint32_t dcmipp_csi_bpp)
{
	const struct stm32_dcmipp_config *config = dev->config;
	struct stm32_dcmipp_data *dcmipp = dev->data;
	DCMIPP_CSI_ConfTypeDef csiconf = { 0 };
	HAL_StatusTypeDef hal_ret;
	int64_t phy_bitrate;
	int i;

	csiconf.NumberOfLanes = config->csi.nb_lanes == 2 ? DCMIPP_CSI_TWO_DATA_LANES :
							    DCMIPP_CSI_ONE_DATA_LANE;
	csiconf.DataLaneMapping = config->csi.lanes[0] == 1 ? DCMIPP_CSI_PHYSICAL_DATA_LANES :
							      DCMIPP_CSI_INVERTED_DATA_LANES;

