zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
	/* Get link-frequency information from source */
	phy_bitrate = video_get_csi_link_freq(config->source_dev,
					      video_bits_per_pixel(dcmipp->source_fmt.pixelformat),
					      config->csi.nb_lanes);
	if (phy_bitrate < 0) {
		LOG_ERR("Failed to retrieve source link-frequency");
		return -EIO;
	}

	phy_bitrate /= MHZ(1);

	for (i = 0; i < ARRAY_SIZE(stm32_dcmipp_bitrate); i++) {
		if (stm32_dcmipp_bitrate[i].rate >= phy_bitrate) {
			break;
		}
	}
	if (i == ARRAY_SIZE(stm32_dcmipp_bitrate)) {
		LOG_ERR("Couldn't find proper CSI PHY settings for bitrate %lld", phy_bitrate);
		return -EINVAL;
	}
	csiconf.PHYBitrate = stm32_dcmipp_bitrate[i].PHYBitrate;

	hal_ret = HAL_DCMIPP_CSI_SetConfig(&dcmipp->hdcmipp, &csiconf);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to configure DCMIPP CSI");
		return -EIO;
	}

	/* Set Virtual Channel config */
	/* TODO - need to be able to use an alternate VC, info coming from the source */
	hal_ret = HAL_DCMIPP_CSI_SetVCConfig(&dcmipp->hdcmipp, DCMIPP_VIRTUAL_CHANNEL0,
					     dcmipp_csi_bpp);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to set CSI configuration");
		return -EIO;
	}

	return 0;
}
#endif

/* Description of DCMIPP inputs */
#define DUMP_PIPE_FMT(fmt, input_fmt)					\
	{								\
		.pixelformat = VIDEO_PIX_FMT_##fmt,			\
		.pipes = BIT(0),					\
		.dump.input_pixelformat = VIDEO_PIX_FMT_##input_fmt,	\
	}
#define RAW_BAYER_UNPACKED(size)				\
	DUMP_PIPE_FMT(SBGGR##size, SBGGR##size),		\
	DUMP_PIPE_FMT(SGBRG##size, SGBRG##size),		\
	DUMP_PIPE_FMT(SGRBG##size, SGRBG##size),		\
	DUMP_PIPE_FMT(SRGGB##size, SRGGB##size)

#define RAW_BAYER_PACKED(size)					\
	DUMP_PIPE_FMT(SBGGR##size##P, SBGGR##size),		\
	DUMP_PIPE_FMT(SGBRG##size##P, SGBRG##size),		\
	DUMP_PIPE_FMT(SGRBG##size##P, SGRBG##size),		\
	DUMP_PIPE_FMT(SRGGB##size##P, SRGGB##size)

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
/* Description of Pixel Pipes formats */
#define PIXEL_PIPE_FMT(fmt, dcmipp, swap, valid_pipes)				\
	{									\
		.pixelformat = VIDEO_PIX_FMT_##fmt,				\
		.pipes = valid_pipes,						\
		.pixels.dcmipp_format = DCMIPP_PIXEL_PACKER_FORMAT_##dcmipp,	\
		.pixels.swap_uv = swap,						\
	}
#endif
static const struct stm32_dcmipp_mapping {
	uint32_t pixelformat;
	uint32_t pipes;
	union {
		struct {
			uint32_t input_pixelformat;
		} dump;
		struct {
			uint32_t dcmipp_format;
			uint32_t swap_uv;
		} pixels;
	};
} stm32_dcmipp_format_support[] = {
	/* Dump pipe format descriptions */
	RAW_BAYER_UNPACKED(8),
	RAW_BAYER_PACKED(10), RAW_BAYER_PACKED(12), RAW_BAYER_PACKED(14),
	DUMP_PIPE_FMT(RGB565, RGB565),
	DUMP_PIPE_FMT(YUYV, YUYV),
	DUMP_PIPE_FMT(GREY, GREY),
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	/* Pixel pipes format descriptions */
	PIXEL_PIPE_FMT(RGB565, RGB565_1, 0, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(YUYV, YUV422_1, 0, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(YVYU, YUV422_1, 1, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(GREY, MONO_Y8_G8_1, 0, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(RGB24, RGB888_YUV444_1, 1, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(BGR24, RGB888_YUV444_1, 0, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(ARGB32, RGBA888, 1, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(ABGR32, RGBA888, 0, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(RGBA32, ARGB8888, 1, (BIT(1) | BIT(2))),
	PIXEL_PIPE_FMT(BGRA32, ARGB8888, 0, (BIT(1) | BIT(2))),
	/* Multi-planes are only available on Pipe main (1) */
	PIXEL_PIPE_FMT(NV12, YUV420_2, 0, BIT(1)),
	PIXEL_PIPE_FMT(NV21, YUV420_2, 1, BIT(1)),
	PIXEL_PIPE_FMT(NV16, YUV422_2, 0, BIT(1)),
	PIXEL_PIPE_FMT(NV61, YUV422_2, 1, BIT(1)),
	PIXEL_PIPE_FMT(YUV420, YUV420_3, 0, BIT(1)),
	PIXEL_PIPE_FMT(YVU420, YUV420_3, 1, BIT(1)),
#endif
};

static const struct stm32_dcmipp_mapping *stm32_dcmipp_get_mapping(uint32_t pixelformat,
								   uint32_t pipe)
{
	for (int i = 0; i < ARRAY_SIZE(stm32_dcmipp_format_support); i++) {
		if (pixelformat == stm32_dcmipp_format_support[i].pixelformat &&
		    BIT(pipe) & stm32_dcmipp_format_support[i].pipes) {
			return &stm32_dcmipp_format_support[i];
		}
	}

	return NULL;
}

static inline void stm32_dcmipp_compute_fmt_pitch(uint32_t pipe_id, struct video_format *fmt)
{
	fmt->pitch = fmt->width * video_bits_per_pixel(fmt->pixelformat) / BITS_PER_BYTE;
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	if (pipe_id == DCMIPP_PIPE1 || pipe_id == DCMIPP_PIPE2) {
		/* On Pipe1 and Pipe2, the pitch must be multiple of 16 bytes */
		fmt->pitch = ROUND_UP(fmt->pitch, 16);
	}
#endif

	/* Update the corresponding fmt->size */
	fmt->size = fmt->pitch * fmt->height;
}

static int stm32_dcmipp_set_fmt(const struct device *dev, struct video_format *fmt)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
	const struct stm32_dcmipp_mapping *mapping;
	int ret = 0;

	/* Sanitize format given */
	mapping = stm32_dcmipp_get_mapping(fmt->pixelformat, pipe->id);
	if (mapping == NULL) {
		LOG_ERR("Pixelformat %s/0x%x is not supported",
			VIDEO_FOURCC_TO_STR(fmt->pixelformat), fmt->pixelformat);
		return -EINVAL;
	}

	/* In case of DUMP pipe, verify that requested format matched with input format */
	if (pipe->id == DCMIPP_PIPE0 &&
	    mapping->dump.input_pixelformat != dcmipp->source_fmt.pixelformat) {
		LOG_ERR("Dump pipe output format (%s) incompatible with source format (%s)",
			 VIDEO_FOURCC_TO_STR(fmt->pixelformat),
			 VIDEO_FOURCC_TO_STR(dcmipp->source_fmt.pixelformat));
		return -EINVAL;
	}

	if (!IN_RANGE(fmt->width, STM32_DCMIPP_WIDTH_MIN, STM32_DCMIPP_WIDTH_MAX) ||
	    !IN_RANGE(fmt->height, STM32_DCMIPP_HEIGHT_MIN, STM32_DCMIPP_HEIGHT_MAX)) {
		LOG_ERR("Format width/height (%d x %d) does not match caps",
			fmt->width, fmt->height);
		return -EINVAL;
	}

	if (fmt->width != pipe->compose.width || fmt->height != pipe->compose.height) {
		LOG_ERR("Format width/height (%d x %d) do not match compose width/height (%d x %d)",
			fmt->width, fmt->height, pipe->compose.width, pipe->compose.height);
		return -EINVAL;
	}

	stm32_dcmipp_compute_fmt_pitch(pipe->id, fmt);

	k_mutex_lock(&pipe->lock, K_FOREVER);

	if (pipe->is_streaming) {
		ret = -EBUSY;
		goto out;
	}

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	if (pipe->id == DCMIPP_PIPE1 || pipe->id == DCMIPP_PIPE2) {
		uint32_t post_isp_decimate_width = dcmipp->source_fmt.width /
						   dcmipp->isp_dec_hratio;
		uint32_t post_isp_decimate_height = dcmipp->source_fmt.height /
						    dcmipp->isp_dec_vratio;

