zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
		if (!IN_RANGE(fmt->width,
			      post_isp_decimate_width / STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR,
			      post_isp_decimate_width) ||
		    !IN_RANGE(fmt->height,
			      post_isp_decimate_height / STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR,
			      post_isp_decimate_height)) {
			LOG_ERR("Requested resolution cannot be achieved");
			ret = -EINVAL;
			goto out;
		}
	}
#endif

	pipe->fmt = *fmt;

out:
	k_mutex_unlock(&pipe->lock);

	return ret;
}

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
static void stm32_dcmipp_get_isp_decimation(struct stm32_dcmipp_data *dcmipp)
{
	DCMIPP_DecimationConfTypeDef ispdec_cfg;
	uint32_t is_enabled;

	is_enabled = HAL_DCMIPP_PIPE_IsEnabledISPDecimation(&dcmipp->hdcmipp, DCMIPP_PIPE1);
	if (is_enabled == 0) {
		dcmipp->isp_dec_hratio = 1;
		dcmipp->isp_dec_vratio = 1;
	} else {
		HAL_DCMIPP_PIPE_GetISPDecimationConfig(&dcmipp->hdcmipp, DCMIPP_PIPE1, &ispdec_cfg);
		dcmipp->isp_dec_hratio = 1 << (ispdec_cfg.HRatio >> DCMIPP_P1DECR_HDEC_Pos);
		dcmipp->isp_dec_vratio = 1 << (ispdec_cfg.VRatio >> DCMIPP_P1DECR_VDEC_Pos);
	}
}
#endif

static int stm32_dcmipp_get_fmt(const struct device *dev, struct video_format *fmt)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;

	*fmt = pipe->fmt;

	return 0;
}

static int stm32_dcmipp_set_crop(struct stm32_dcmipp_pipe_data *pipe)
{
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
	DCMIPP_CropConfTypeDef crop_cfg;
	uint32_t frame_width = dcmipp->source_fmt.width;
	uint32_t frame_height = dcmipp->source_fmt.height;
	HAL_StatusTypeDef hal_ret;

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	if (pipe->id == DCMIPP_PIPE1 || pipe->id == DCMIPP_PIPE2) {
		frame_width /= dcmipp->isp_dec_hratio;
		frame_height /= dcmipp->isp_dec_vratio;
	}
#endif

	/* If crop area is equal to frame size, disable the crop */
	if (pipe->crop.width == frame_width && pipe->crop.height == frame_height) {
		hal_ret = HAL_DCMIPP_PIPE_DisableCrop(&dcmipp->hdcmipp, pipe->id);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to disable pipe crop");
			return -EIO;
		}

		return 0;
	}

	crop_cfg.VStart = pipe->crop.top;
	crop_cfg.VSize = pipe->crop.height;

	/*
	 * In case of Pipe0, left & width are expressed in word (32bit).
	 * set_selection ensure that value leads to a multiple of 32bit word
	 */
	if (pipe->id == DCMIPP_PIPE0) {
		unsigned int bpp = video_bits_per_pixel(pipe->fmt.pixelformat);

		crop_cfg.HStart = pipe->crop.left * bpp / 32;
		crop_cfg.HSize = pipe->crop.width * bpp / 32;
	}
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	else {
		crop_cfg.HStart = pipe->crop.left;
		crop_cfg.HSize = pipe->crop.width;
	}
#endif

	hal_ret = HAL_DCMIPP_PIPE_SetCropConfig(&dcmipp->hdcmipp, pipe->id, &crop_cfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to configure pipe crop");
		return -EIO;
	}

	hal_ret = HAL_DCMIPP_PIPE_EnableCrop(&dcmipp->hdcmipp, pipe->id);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to enable pipe crop");
		return -EIO;
	}

	return 0;
}

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
#define STM32_DCMIPP_DSIZE_HVRATIO_CONS   8192
#define STM32_DCMIPP_DSIZE_HVRATIO_MAX    65535
#define STM32_DCMIPP_DSIZE_HVDIV_CONS     1024
#define STM32_DCMIPP_DSIZE_HVDIV_MAX      1023
static int stm32_dcmipp_set_downscale(struct stm32_dcmipp_pipe_data *pipe)
{
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
	uint32_t post_decimate_width = pipe->crop.width;
	uint32_t post_decimate_height = pipe->crop.height;
	DCMIPP_DecimationConfTypeDef dec_cfg;
	DCMIPP_DownsizeTypeDef downsize_cfg;
	struct video_rect *compose = &pipe->compose;
	uint32_t hdec = 1, vdec = 1;
	HAL_StatusTypeDef hal_ret;

	if (compose->width == pipe->crop.width && compose->height == pipe->crop.height) {
		hal_ret = HAL_DCMIPP_PIPE_DisableDecimation(&dcmipp->hdcmipp, pipe->id);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to disable the pipe decimation");
			return -EIO;
		}

		hal_ret = HAL_DCMIPP_PIPE_DisableDownsize(&dcmipp->hdcmipp, pipe->id);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to disable the pipe downsize");
			return -EIO;
		}

		return 0;
	}

	/* Compute decimation factors (HDEC/VDEC) */
	while (compose->width * STM32_DCMIPP_MAX_PIPE_DSIZE_FACTOR < post_decimate_width) {
		hdec *= 2;
		post_decimate_width /= 2;
	}
	while (compose->height * STM32_DCMIPP_MAX_PIPE_DSIZE_FACTOR < post_decimate_height) {
		vdec *= 2;
		post_decimate_height /= 2;
	}

	if (hdec == 1 && vdec == 1) {
		hal_ret = HAL_DCMIPP_PIPE_DisableDecimation(&dcmipp->hdcmipp, pipe->id);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to disable the pipe decimation");
			return -EIO;
		}
	} else {
		/* Use same decimation factor in width / height to keep aspect ratio */
		dec_cfg.HRatio = __builtin_ctz(hdec) << DCMIPP_P1DECR_HDEC_Pos;
		dec_cfg.VRatio = __builtin_ctz(vdec) << DCMIPP_P1DECR_VDEC_Pos;

		hal_ret = HAL_DCMIPP_PIPE_SetDecimationConfig(&dcmipp->hdcmipp, pipe->id, &dec_cfg);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to disable the pipe decimation");
			return -EIO;
		}
		hal_ret = HAL_DCMIPP_PIPE_EnableDecimation(&dcmipp->hdcmipp, pipe->id);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to enable the pipe decimation");
			return -EIO;
		}
	}

	/* Compute downsize factor */
	downsize_cfg.HRatio =
		post_decimate_width * STM32_DCMIPP_DSIZE_HVRATIO_CONS / compose->width;
	if (downsize_cfg.HRatio > STM32_DCMIPP_DSIZE_HVRATIO_MAX) {
		downsize_cfg.HRatio = STM32_DCMIPP_DSIZE_HVRATIO_MAX;
	}
	downsize_cfg.VRatio =
		post_decimate_height * STM32_DCMIPP_DSIZE_HVRATIO_CONS / compose->height;
	if (downsize_cfg.VRatio > STM32_DCMIPP_DSIZE_HVRATIO_MAX) {
		downsize_cfg.VRatio = STM32_DCMIPP_DSIZE_HVRATIO_MAX;
	}
	downsize_cfg.HDivFactor =
		STM32_DCMIPP_DSIZE_HVDIV_CONS * compose->width / post_decimate_width;
	if (downsize_cfg.HDivFactor > STM32_DCMIPP_DSIZE_HVDIV_MAX) {
		downsize_cfg.HDivFactor = STM32_DCMIPP_DSIZE_HVDIV_MAX;
	}
	downsize_cfg.VDivFactor =
		STM32_DCMIPP_DSIZE_HVDIV_CONS * compose->height / post_decimate_height;
	if (downsize_cfg.VDivFactor > STM32_DCMIPP_DSIZE_HVDIV_MAX) {
		downsize_cfg.VDivFactor = STM32_DCMIPP_DSIZE_HVDIV_MAX;
	}
	downsize_cfg.HSize = compose->width;
	downsize_cfg.VSize = compose->height;

	hal_ret = HAL_DCMIPP_PIPE_SetDownsizeConfig(&dcmipp->hdcmipp, pipe->id, &downsize_cfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to configure the pipe downsize");
		return -EIO;
	}

	hal_ret = HAL_DCMIPP_PIPE_EnableDownsize(&dcmipp->hdcmipp, pipe->id);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to enable the pipe downsize");
		return -EIO;
	}

