zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
	return 0;
}

/* No clamping enabled */
/* RGB Full to YUV 601 Full */
const DCMIPP_ColorConversionConfTypeDef stm32_dcmipp_rgb_to_yuv = {
	.RR = 131, .RG = -110, .RB = -21, .RA = 128,
	.GR =  77, .GG =  150, .GB =  29, .GA =   0,
	.BR = -44, .BG =  -87, .BB = 131, .BA = 128,
};

/* YUV 601 Full to RGB Full */
const DCMIPP_ColorConversionConfTypeDef stm32_dcmipp_yuv_to_rgb = {
	.RR =  351, .RG = 256, .RB =   0, .RA = -175,
	.GR = -179, .GG = 256, .GB = -86, .GA =  132,
	.BR =    0, .BG = 256, .BB = 443, .BA = -222,
};

static int stm32_dcmipp_set_yuv_conversion(struct stm32_dcmipp_pipe_data *pipe,
					   uint32_t source_pixelformat,
					   uint32_t output_pixelformat)
{
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
	const DCMIPP_ColorConversionConfTypeDef *cfg = NULL;
	HAL_StatusTypeDef hal_ret;

	/* No YUV conversion on pipe 2 */
	if (pipe->id == DCMIPP_PIPE2) {
		return 0;
	}

	/* Perform YUV conversion if necessary and possible */
	if ((VIDEO_FMT_IS_BAYER(source_pixelformat) || VIDEO_FMT_IS_RGB(source_pixelformat)) &&
	    VIDEO_FMT_IS_YUV(output_pixelformat)) {
		/* Need to perform RGB to YUV conversion */
		cfg = &stm32_dcmipp_rgb_to_yuv;
	} else if (VIDEO_FMT_IS_YUV(source_pixelformat) && VIDEO_FMT_IS_RGB(output_pixelformat)) {
		/* Need to perform YUV to RGB conversion */
		cfg = &stm32_dcmipp_yuv_to_rgb;
	} else {
		hal_ret = HAL_DCMIPP_PIPE_DisableYUVConversion(&dcmipp->hdcmipp, pipe->id);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to disable YUV conversion");
			return -EIO;
		}

		return 0;
	}

	hal_ret = HAL_DCMIPP_PIPE_SetYUVConversionConfig(&dcmipp->hdcmipp, pipe->id, cfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to setup YUV conversion");
		return -EIO;
	}

	hal_ret = HAL_DCMIPP_PIPE_EnableYUVConversion(&dcmipp->hdcmipp, pipe->id);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to disable YUV conversion");
		return -EIO;
	}

	return 0;
}
#endif

static int stm32_dcmipp_start_pipeline(const struct device *dev,
				       struct stm32_dcmipp_pipe_data *pipe)
{
	const struct stm32_dcmipp_config *config = dev->config;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	struct video_format *fmt = &pipe->fmt;
#endif
	HAL_StatusTypeDef hal_ret;

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	if (VIDEO_FMT_IS_FULL_PLANAR(fmt->pixelformat)) {
		uint8_t *u_addr = pipe->next->buffer + VIDEO_FMT_PLANAR_Y_PLANE_SIZE(fmt);
		uint8_t *v_addr = u_addr + (VIDEO_FMT_PLANAR_Y_PLANE_SIZE(fmt) / 4);
		DCMIPP_FullPlanarDstAddressTypeDef planar_addr = {
			.YAddress = (uint32_t)pipe->next->buffer,
			.UAddress = (uint32_t)u_addr,
			.VAddress = (uint32_t)v_addr,
		};

		if (config->bus_type == VIDEO_BUS_TYPE_PARALLEL) {
			hal_ret = HAL_DCMIPP_PIPE_FullPlanarStart(&dcmipp->hdcmipp, pipe->id,
								  &planar_addr,
								  DCMIPP_MODE_CONTINUOUS);
		}
#if defined(STM32_DCMIPP_HAS_CSI)
		else if (config->bus_type == VIDEO_BUS_TYPE_CSI2_DPHY) {
			hal_ret = HAL_DCMIPP_CSI_PIPE_FullPlanarStart(&dcmipp->hdcmipp, pipe->id,
								      DCMIPP_VIRTUAL_CHANNEL0,
								      &planar_addr,
								      DCMIPP_MODE_CONTINUOUS);
		}
#endif
		else {
			LOG_ERR("Invalid bus_type");
			hal_ret = HAL_ERROR;
		}
	} else if (VIDEO_FMT_IS_SEMI_PLANAR(fmt->pixelformat)) {
		uint8_t *uv_addr = pipe->next->buffer + VIDEO_FMT_PLANAR_Y_PLANE_SIZE(fmt);
		DCMIPP_SemiPlanarDstAddressTypeDef semiplanar_addr = {
			.YAddress = (uint32_t)pipe->next->buffer,
			.UVAddress = (uint32_t)uv_addr,
		};

		if (config->bus_type == VIDEO_BUS_TYPE_PARALLEL) {
			hal_ret = HAL_DCMIPP_PIPE_SemiPlanarStart(&dcmipp->hdcmipp, pipe->id,
								  &semiplanar_addr,
								  DCMIPP_MODE_CONTINUOUS);
		}
#if defined(STM32_DCMIPP_HAS_CSI)
		else if (config->bus_type == VIDEO_BUS_TYPE_CSI2_DPHY) {
			hal_ret = HAL_DCMIPP_CSI_PIPE_SemiPlanarStart(&dcmipp->hdcmipp, pipe->id,
								      DCMIPP_VIRTUAL_CHANNEL0,
								      &semiplanar_addr,
								      DCMIPP_MODE_CONTINUOUS);
		}
#endif
		else {
			LOG_ERR("Invalid bus_type");
			hal_ret = HAL_ERROR;
		}
	} else {
#endif
		if (config->bus_type == VIDEO_BUS_TYPE_PARALLEL) {
			hal_ret = HAL_DCMIPP_PIPE_Start(&dcmipp->hdcmipp, pipe->id,
							(uint32_t)pipe->next->buffer,
							DCMIPP_MODE_CONTINUOUS);
		}
#if defined(STM32_DCMIPP_HAS_CSI)
		else if (config->bus_type == VIDEO_BUS_TYPE_CSI2_DPHY) {
			hal_ret = HAL_DCMIPP_CSI_PIPE_Start(&dcmipp->hdcmipp, pipe->id,
							    DCMIPP_VIRTUAL_CHANNEL0,
							    (uint32_t)pipe->next->buffer,
							    DCMIPP_MODE_CONTINUOUS);
		}
#endif
		else {
			LOG_ERR("Invalid bus_type");
			hal_ret = HAL_ERROR;
		}
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	}
#endif
	if (hal_ret != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static int stm32_dcmipp_stream_enable(const struct device *dev)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
	const struct stm32_dcmipp_config *config = dev->config;
	struct video_format *fmt = &pipe->fmt;
	const struct stm32_dcmipp_mapping *mapping;
	const struct stm32_dcmipp_input_fmt *input_fmt;
#if defined(STM32_DCMIPP_HAS_CSI)
	DCMIPP_CSI_PIPE_ConfTypeDef csi_pipe_cfg = { 0 };
#endif
	DCMIPP_PipeConfTypeDef pipe_cfg = { 0 };
	HAL_StatusTypeDef hal_ret;
	int ret;

	k_mutex_lock(&pipe->lock, K_FOREVER);

	if (pipe->is_streaming) {
		ret = -EALREADY;
		goto out;
	}

	input_fmt = stm32_dcmipp_get_input_info(dcmipp->source_fmt.pixelformat);
	if (input_fmt == NULL) {
		LOG_ERR("Unsupported input format");
		ret = -EINVAL;
		goto out;
	}

	/* Configure the source if nothing is already running */
	if (dcmipp->enabled_pipe == 0) {
		ret = video_set_format(config->source_dev, &dcmipp->source_fmt);
		if (ret < 0) {
			goto out;
		}

		if (config->bus_type == VIDEO_BUS_TYPE_PARALLEL) {
			ret = stm32_dcmipp_conf_parallel(dcmipp->dev, input_fmt);
		}
#if defined(STM32_DCMIPP_HAS_CSI)
		else if (config->bus_type == VIDEO_BUS_TYPE_CSI2_DPHY) {
			ret = stm32_dcmipp_conf_csi(dcmipp->dev, input_fmt->dcmipp_csi_bpp);
		}
#endif
		else {
			LOG_ERR("Invalid bus_type");
			ret = -EINVAL;
			goto out;
		}
		if (ret < 0) {
			LOG_ERR("Failed to configure input stage");
			goto out;
		}
	}

