zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
	pipe->active = NULL;
	pipe->next = k_fifo_get(&pipe->fifo_in, K_NO_WAIT);
	if (pipe->next == NULL) {
		LOG_ERR("No buffer available to start streaming");
		ret = -ENOMEM;
		goto out;
	}

#if defined(STM32_DCMIPP_HAS_CSI)
	/* Configure the Pipe input */
	csi_pipe_cfg.DataTypeMode = DCMIPP_DTMODE_DTIDA;
	csi_pipe_cfg.DataTypeIDA  = input_fmt->dcmipp_csi_dt;
	hal_ret = HAL_DCMIPP_CSI_PIPE_SetConfig(&dcmipp->hdcmipp,
						pipe->id == DCMIPP_PIPE2 ? DCMIPP_PIPE1 : pipe->id,
						&csi_pipe_cfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to configure pipe #%d input", pipe->id);
		ret = -EIO;
		goto out;
	}
#endif

	/* Configure Pipe */
	mapping = stm32_dcmipp_get_mapping(fmt->pixelformat, pipe->id);
	if (mapping == NULL) {
		LOG_ERR("Failed to find pipe format mapping");
		ret = -EIO;
		goto out;
	}

	pipe_cfg.FrameRate  = DCMIPP_FRAME_RATE_ALL;
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	if (pipe->id == DCMIPP_PIPE1 || pipe->id == DCMIPP_PIPE2) {
		pipe_cfg.PixelPipePitch = VIDEO_Y_PLANE_PITCH(fmt);
		pipe_cfg.PixelPackerFormat = mapping->pixels.dcmipp_format;
	}
#endif
	hal_ret = HAL_DCMIPP_PIPE_SetConfig(&dcmipp->hdcmipp, pipe->id, &pipe_cfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to configure pipe #%d", pipe->id);
		ret = -EIO;
		goto out;
	}

	if (pipe->id == DCMIPP_PIPE0) {
		/* Configure the Pipe crop */
		ret = stm32_dcmipp_set_crop(pipe);
		if (ret < 0) {
			goto out;
		}

		/* Only the PIPE0 has a limiter */
		/* Set Limiter to avoid buffer overflow, in number of 32 bits words */
		hal_ret = HAL_DCMIPP_PIPE_EnableLimitEvent(&dcmipp->hdcmipp, DCMIPP_PIPE0,
							   (fmt->pitch * fmt->height) / 4);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to set limiter");
			ret = -EIO;
			goto out;
		}
	}
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	else if (pipe->id == DCMIPP_PIPE1 || pipe->id == DCMIPP_PIPE2) {
		/* Enable / disable SWAPRB if necessary */
		if (mapping->pixels.swap_uv) {
			hal_ret = HAL_DCMIPP_PIPE_EnableRedBlueSwap(&dcmipp->hdcmipp, pipe->id);
			if (hal_ret != HAL_OK) {
				LOG_ERR("Failed to enable Red-Blue swap");
				ret = -EIO;
				goto out;
			}
		} else {
			hal_ret = HAL_DCMIPP_PIPE_DisableRedBlueSwap(&dcmipp->hdcmipp, pipe->id);
			if (hal_ret != HAL_OK) {
				LOG_ERR("Failed to disable Red-Blue swap");
				ret = -EIO;
				goto out;
			}
		}

		if (VIDEO_FMT_IS_BAYER(dcmipp->source_fmt.pixelformat)) {
			/* Enable demosaicing if input format is Bayer */
			hal_ret = HAL_DCMIPP_PIPE_EnableISPRawBayer2RGB(&dcmipp->hdcmipp,
									DCMIPP_PIPE1);
			if (hal_ret != HAL_OK) {
				LOG_ERR("Failed to enable demosaicing");
				ret = -EIO;
				goto out;
			}
		} else {
			/* Disable demosaicing */
			hal_ret = HAL_DCMIPP_PIPE_DisableISPRawBayer2RGB(&dcmipp->hdcmipp,
									 DCMIPP_PIPE1);
			if (hal_ret != HAL_OK) {
				LOG_ERR("Failed to disable demosaicing");
				ret = -EIO;
				goto out;
			}
		}

		/* Configure the Pipe crop */
		ret = stm32_dcmipp_set_crop(pipe);
		if (ret < 0) {
			goto out;
		}

		/* Configure the Pipe decimation / downsize */
		ret = stm32_dcmipp_set_downscale(pipe);
		if (ret < 0) {
			goto out;
		}

		/* Configure YUV conversion */
		ret = stm32_dcmipp_set_yuv_conversion(pipe,
						      dcmipp->source_fmt.pixelformat,
						      fmt->pixelformat);
		if (ret < 0) {
			goto out;
		}

		/* Limit the amount of hardware handshake interrupts received by slave IP */
		if (pipe->id == DCMIPP_PIPE1) {
			stm32_reg_modify_bits(&dcmipp->hdcmipp.Instance->P1PPCR,
					      DCMIPP_P1PPCR_LINEMULT_Msk,
					      DCMIPP_MULTILINE_128_LINES);
		} else {
			stm32_reg_modify_bits(&dcmipp->hdcmipp.Instance->P2PPCR,
					      DCMIPP_P1PPCR_LINEMULT_Msk,
					      DCMIPP_MULTILINE_128_LINES);
		}
	}
#endif

	/* Enable the DCMIPP Pipeline */
	ret = stm32_dcmipp_start_pipeline(dev, pipe);
	if (ret < 0) {
		LOG_ERR("Failed to start the pipeline");
		goto out;
	}

	/* It is necessary to start the source as well if nothing else is running */
	if (dcmipp->enabled_pipe == 0) {
		ret = video_stream_start(config->source_dev, VIDEO_BUF_TYPE_OUTPUT);
		if (ret < 0) {
			LOG_ERR("Failed to start the source");
			if (config->bus_type == VIDEO_BUS_TYPE_PARALLEL) {
				if (HAL_DCMIPP_PIPE_Stop(&dcmipp->hdcmipp, pipe->id) != HAL_OK) {
					ret = -EIO;
					goto out;
				}
			}
#if defined(STM32_DCMIPP_HAS_CSI)
			else if (config->bus_type == VIDEO_BUS_TYPE_CSI2_DPHY) {
				if (HAL_DCMIPP_CSI_PIPE_Stop(&dcmipp->hdcmipp, pipe->id,
							     DCMIPP_VIRTUAL_CHANNEL0) != HAL_OK) {
					ret = -EIO;
					goto out;
				}
			}
#endif
			else {
				LOG_ERR("Invalid bus_type");
			}
			ret = -EIO;
			goto out;
		}
	}

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	/* Start the external ISP handling */
	ret = stm32_dcmipp_isp_start();
	if (ret < 0) {
		goto out;
	}
#endif

	pipe->state = STM32_DCMIPP_RUNNING;
	pipe->is_streaming = true;
	dcmipp->enabled_pipe++;

out:
	k_mutex_unlock(&pipe->lock);

	return ret;
}

static int stm32_dcmipp_stream_disable(const struct device *dev)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
	const struct stm32_dcmipp_config *config = dev->config;
	struct video_buffer *vbuf;
	int ret;

	k_mutex_lock(&pipe->lock, K_FOREVER);

	if (!pipe->is_streaming) {
		ret = -EINVAL;
		goto out;
	}

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	/* Stop the external ISP handling */
	ret = stm32_dcmipp_isp_stop();
	if (ret < 0) {
		goto out;
	}
#endif

	/* Disable the DCMIPP Pipeline */
	ret = 0;
	if (config->bus_type == VIDEO_BUS_TYPE_PARALLEL) {
		if (HAL_DCMIPP_PIPE_Stop(&dcmipp->hdcmipp, pipe->id) != HAL_OK) {
			ret = -EIO;
		}
	}
#if defined(STM32_DCMIPP_HAS_CSI)
	else if (config->bus_type == VIDEO_BUS_TYPE_CSI2_DPHY) {
		if (HAL_DCMIPP_CSI_PIPE_Stop(&dcmipp->hdcmipp, pipe->id,
					     DCMIPP_VIRTUAL_CHANNEL0) != HAL_OK) {
			ret = -EIO;
		}
	}
#endif
	else {
		LOG_ERR("Invalid bus_type");
		ret = -EIO;
		goto out;
	}
	if (ret < 0) {
		LOG_ERR("Failed to stop the pipeline");
		goto out;
	}

	/* Turn off the source nobody else is using the DCMIPP */
	if (dcmipp->enabled_pipe == 1) {
		ret = video_stream_stop(config->source_dev, VIDEO_BUF_TYPE_OUTPUT);
		if (ret < 0) {
			LOG_ERR("Failed to stop the source");
			ret = -EIO;
			goto out;
		}
	}

	/* Release the video buffer allocated when start streaming */
	if (pipe->next != NULL) {
		k_fifo_put(&pipe->fifo_in, pipe->next);
	}
	if (pipe->active != NULL) {
		k_fifo_put(&pipe->fifo_in, pipe->active);
	}

