zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
	/* Forward all buffers in fifo_in to fifo_out */
	while ((vbuf = k_fifo_get(&pipe->fifo_in, K_NO_WAIT)) != NULL) {
		vbuf->bytesused = 0;
		k_fifo_put(&pipe->fifo_out, vbuf);
	}

	pipe->state = STM32_DCMIPP_STOPPED;
	pipe->is_streaming = false;
	dcmipp->enabled_pipe--;

out:
	k_mutex_unlock(&pipe->lock);

	return ret;
}

static int stm32_dcmipp_set_stream(const struct device *dev, bool enable, enum video_buf_type type)
{
	return enable ? stm32_dcmipp_stream_enable(dev) : stm32_dcmipp_stream_disable(dev);
}

static int stm32_dcmipp_enqueue(const struct device *dev, struct video_buffer *vbuf)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;

	k_mutex_lock(&pipe->lock, K_FOREVER);

	if (pipe->fmt.pitch * pipe->fmt.height > vbuf->size) {
		return -EINVAL;
	}

	if (pipe->state == STM32_DCMIPP_WAIT_FOR_BUFFER) {
		LOG_DBG("Restart CPTREQ after wait for buffer");
		pipe->next = vbuf;
		stm32_dcmipp_set_next_buffer_addr(pipe);
		if (pipe->id == DCMIPP_PIPE0) {
			stm32_reg_set_bits(&dcmipp->hdcmipp.Instance->P0FCTCR,
					   DCMIPP_P0FCTCR_CPTREQ);
		}
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
		else if (pipe->id == DCMIPP_PIPE1) {
			stm32_reg_set_bits(&dcmipp->hdcmipp.Instance->P1FCTCR,
					   DCMIPP_P1FCTCR_CPTREQ);
		} else if (pipe->id == DCMIPP_PIPE2) {
			stm32_reg_set_bits(&dcmipp->hdcmipp.Instance->P2FCTCR,
					   DCMIPP_P2FCTCR_CPTREQ);
		}
#endif
		pipe->state = STM32_DCMIPP_RUNNING;
	} else {
		k_fifo_put(&pipe->fifo_in, vbuf);
	}

	k_mutex_unlock(&pipe->lock);

	return 0;
}

static int stm32_dcmipp_dequeue(const struct device *dev, struct video_buffer **vbuf,
				k_timeout_t timeout)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;

	*vbuf = k_fifo_get(&pipe->fifo_out, timeout);
	if (*vbuf == NULL) {
		return -EAGAIN;
	}

	return 0;
}

/*
 * For MAIN / AUX pipe, it is necessary that the pitch is a multiple of 16 bytes.
 * Give here the multiple in number of pixels, which depends on the format chosen
 */
#define DCMIPP_CEIL_DIV_ROUND_UP_MUL(val, div, mul)						\
		((((val) + (div) - 1) / (div) + (mul) - 1) / (mul) * (mul))

#define DCMIPP_CEIL_DIV(val, div)								\
		(((val) + (div) - 1) / (div))

static const struct video_format_cap stm32_dcmipp_dump_fmt[] = {
	{
		.pixelformat = VIDEO_FOURCC_FROM_STR(CONFIG_VIDEO_STM32_DCMIPP_SENSOR_PIXEL_FORMAT),
		.width_min = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_WIDTH,
		.width_max = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_WIDTH,
		.height_min = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_HEIGHT,
		.height_max = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_HEIGHT,
		.width_step = 1, .height_step = 1,
	},
	{0},
};

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
#define DCMIPP_VIDEO_FORMAT_CAP(format, pixmul)	{						\
	.pixelformat = VIDEO_PIX_FMT_##format,							\
	.width_min = DCMIPP_CEIL_DIV_ROUND_UP_MUL(CONFIG_VIDEO_STM32_DCMIPP_SENSOR_WIDTH,	\
						  STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR,		\
						  pixmul),					\
	.width_max = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_WIDTH / (pixmul) * (pixmul),		\
	.height_min = DCMIPP_CEIL_DIV(CONFIG_VIDEO_STM32_DCMIPP_SENSOR_HEIGHT,			\
				      STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR),			\
	.height_max = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_HEIGHT,					\
	.width_step = pixmul, .height_step = 1,							\
}

static const struct video_format_cap stm32_dcmipp_main_fmts[] = {
	DCMIPP_VIDEO_FORMAT_CAP(RGB565, 8),
	DCMIPP_VIDEO_FORMAT_CAP(YUYV, 8),
	DCMIPP_VIDEO_FORMAT_CAP(YVYU, 8),
	DCMIPP_VIDEO_FORMAT_CAP(GREY, 16),
	DCMIPP_VIDEO_FORMAT_CAP(RGB24, 16),
	DCMIPP_VIDEO_FORMAT_CAP(BGR24, 16),
	DCMIPP_VIDEO_FORMAT_CAP(ARGB32, 4),
	DCMIPP_VIDEO_FORMAT_CAP(ABGR32, 4),
	DCMIPP_VIDEO_FORMAT_CAP(RGBA32, 4),
	DCMIPP_VIDEO_FORMAT_CAP(BGRA32, 4),
	DCMIPP_VIDEO_FORMAT_CAP(NV12, 16),
	DCMIPP_VIDEO_FORMAT_CAP(NV21, 16),
	DCMIPP_VIDEO_FORMAT_CAP(NV16, 16),
	DCMIPP_VIDEO_FORMAT_CAP(NV61, 16),
	DCMIPP_VIDEO_FORMAT_CAP(YUV420, 16),
	DCMIPP_VIDEO_FORMAT_CAP(YVU420, 16),
	{0},
};

static const struct video_format_cap stm32_dcmipp_aux_fmts[] = {
	DCMIPP_VIDEO_FORMAT_CAP(RGB565, 8),
	DCMIPP_VIDEO_FORMAT_CAP(YUYV, 8),
	DCMIPP_VIDEO_FORMAT_CAP(YVYU, 8),
	DCMIPP_VIDEO_FORMAT_CAP(GREY, 16),
	DCMIPP_VIDEO_FORMAT_CAP(RGB24, 16),
	DCMIPP_VIDEO_FORMAT_CAP(BGR24, 16),
	DCMIPP_VIDEO_FORMAT_CAP(ARGB32, 4),
	DCMIPP_VIDEO_FORMAT_CAP(ABGR32, 4),
	DCMIPP_VIDEO_FORMAT_CAP(RGBA32, 4),
	DCMIPP_VIDEO_FORMAT_CAP(BGRA32, 4),
	{0},
};
#endif

static int stm32_dcmipp_get_caps(const struct device *dev, struct video_caps *caps)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;

	switch (pipe->id) {
	case DCMIPP_PIPE0:
		caps->format_caps = stm32_dcmipp_dump_fmt;
		break;
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	case DCMIPP_PIPE1:
		caps->format_caps = stm32_dcmipp_main_fmts;
		break;
	case DCMIPP_PIPE2:
		caps->format_caps = stm32_dcmipp_aux_fmts;
		break;
#endif
	default:
		CODE_UNREACHABLE;
	}

	caps->min_vbuf_count = 1;
	caps->buf_align = 16;

	return 0;
}

static int stm32_dcmipp_get_frmival(const struct device *dev, struct video_frmival *frmival)
{
	const struct stm32_dcmipp_config *config = dev->config;

	return video_get_frmival(config->source_dev, frmival);
}

static int stm32_dcmipp_set_frmival(const struct device *dev, struct video_frmival *frmival)
{
	const struct stm32_dcmipp_config *config = dev->config;

	return video_set_frmival(config->source_dev, frmival);
}

static int stm32_dcmipp_enum_frmival(const struct device *dev, struct video_frmival_enum *fie)
{
	const struct stm32_dcmipp_config *config = dev->config;

	return video_enum_frmival(config->source_dev, fie);
}

static inline int stm32_dcmipp_pipe0_pixel_align(uint32_t pixelformat)
{
	unsigned int bpp = video_bits_per_pixel(pixelformat);

	/*
	 * Pipe0 crop work in number of lines (vertically) but in 32bit words horizontally.
	 * So capabilities of crop depends on the format. As an example, if the format is
	 * 8bpp, then step will be 4 pixels, for 16bpp, step will be 2 pixels,
	 * for 32bpp, step will be 1 pixel, and for 24bpp step will be 4 pixels
	 */

	if (bpp == 8 || bpp == 24) {
		return 4;
	}
	if (bpp == 16) {
		return 2;
	}
	if (bpp == 32) {
		return 1;
	}

