zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
	/* Unknown bpp */
	return 0;
}

static int stm32_dcmipp_set_selection(const struct device *dev, struct video_selection *sel)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;
	uint32_t frame_width = dcmipp->source_fmt.width;
	uint32_t frame_height = dcmipp->source_fmt.height;

	if (sel->type != VIDEO_BUF_TYPE_OUTPUT) {
		return -EINVAL;
	}

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	if (pipe->id == DCMIPP_PIPE1 || pipe->id == DCMIPP_PIPE2) {
		frame_width /= dcmipp->isp_dec_hratio;
		frame_height /= dcmipp->isp_dec_vratio;
	}
#endif

	switch (sel->target) {
	case VIDEO_SEL_TGT_CROP:
		/* Reset to the whole frame if the requested rectangle isn't part of the frame */
		if (!IN_RANGE(sel->rect.top, 0, frame_height - 1) ||
		    !IN_RANGE(sel->rect.height, 1, frame_height - sel->rect.top) ||
		    !IN_RANGE(sel->rect.left, 0, frame_width - 1) ||
		    !IN_RANGE(sel->rect.width, 1, frame_width - sel->rect.left)) {
			sel->rect.top = 0;
			sel->rect.left = 0;
			sel->rect.width = frame_width;
			sel->rect.height = frame_height;
		}

		/*
		 * Adjust value to horizontal alignment constraints for PIPE0
		 * except if crop area is the full frame
		 */
		if (pipe->id == DCMIPP_PIPE0 &&
		    !(sel->rect.left == 0 || sel->rect.width == frame_width)) {
			int h_pixel_align = stm32_dcmipp_pipe0_pixel_align(pipe->fmt.pixelformat);

			if (h_pixel_align == 0) {
				LOG_ERR("Cannot figure out required pixel alignment");
				return -EIO;
			}

			sel->rect.left = ROUND_DOWN(sel->rect.left, h_pixel_align);
			sel->rect.width = ROUND_DOWN(sel->rect.width, h_pixel_align);
		}

		k_mutex_lock(&pipe->lock, K_FOREVER);
		pipe->crop = sel->rect;
		pipe->compose.width = sel->rect.width;
		pipe->compose.height = sel->rect.height;
		pipe->fmt.width = sel->rect.width;
		pipe->fmt.height = sel->rect.height;
		stm32_dcmipp_compute_fmt_pitch(pipe->id, &pipe->fmt);
		k_mutex_unlock(&pipe->lock);
		break;
	case VIDEO_SEL_TGT_COMPOSE:
		/* Compose not available on Pipe0 */
		if (pipe->id == DCMIPP_PIPE0) {
			sel->rect = pipe->crop;
			goto out;
		}

		if (sel->rect.left != 0) {
			sel->rect.left = 0;
		}
		if (sel->rect.top != 0) {
			sel->rect.top = 0;
		}

		if (!IN_RANGE(sel->rect.width,
			      pipe->crop.width / STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR,
			      pipe->crop.width)) {
			sel->rect.width = pipe->crop.width / STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR;
		}

		if (!IN_RANGE(sel->rect.height,
			      pipe->crop.height / STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR,
			      pipe->crop.height)) {
			sel->rect.height = pipe->crop.height / STM32_DCMIPP_MAX_PIPE_SCALE_FACTOR;
		}

		k_mutex_lock(&pipe->lock, K_FOREVER);
		pipe->compose = sel->rect;
		pipe->fmt.width = sel->rect.width;
		pipe->fmt.height = sel->rect.height;
		stm32_dcmipp_compute_fmt_pitch(pipe->id, &pipe->fmt);
		k_mutex_unlock(&pipe->lock);
		break;
	default:
		return -EINVAL;
	};

out:
	return 0;
}

static int stm32_dcmipp_get_selection(const struct device *dev, struct video_selection *sel)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;

	if (sel->type != VIDEO_BUF_TYPE_OUTPUT) {
		return -EINVAL;
	}

	switch (sel->target) {
	case VIDEO_SEL_TGT_CROP:
		sel->rect = pipe->crop;
		break;
	case VIDEO_SEL_TGT_COMPOSE:
		sel->rect = pipe->compose;
		break;
	case VIDEO_SEL_TGT_CROP_BOUND:
	case VIDEO_SEL_TGT_COMPOSE_BOUND:
		sel->rect.top = 0;
		sel->rect.left = 0;
		if (pipe->id == DCMIPP_PIPE0) {
			sel->rect.width = dcmipp->source_fmt.width;
			sel->rect.height = dcmipp->source_fmt.height;
		}
#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
		else if (pipe->id == DCMIPP_PIPE1 || pipe->id == DCMIPP_PIPE2) {
			sel->rect.width = dcmipp->source_fmt.width / dcmipp->isp_dec_hratio;
			sel->rect.height = dcmipp->source_fmt.height / dcmipp->isp_dec_vratio;
		}
#endif
		break;
	case VIDEO_SEL_TGT_NATIVE_SIZE:
		sel->rect.top = 0;
		sel->rect.left = 0;
		sel->rect.width = dcmipp->source_fmt.width;
		sel->rect.height = dcmipp->source_fmt.height;
		break;
	default:
		return -EINVAL;
	};

	return 0;
}

static DEVICE_API(video, stm32_dcmipp_driver_api) = {
	.set_format = stm32_dcmipp_set_fmt,
	.get_format = stm32_dcmipp_get_fmt,
	.set_stream = stm32_dcmipp_set_stream,
	.enqueue = stm32_dcmipp_enqueue,
	.dequeue = stm32_dcmipp_dequeue,
	.get_caps = stm32_dcmipp_get_caps,
	.get_frmival = stm32_dcmipp_get_frmival,
	.set_frmival = stm32_dcmipp_set_frmival,
	.enum_frmival = stm32_dcmipp_enum_frmival,
	.set_selection = stm32_dcmipp_set_selection,
	.get_selection = stm32_dcmipp_get_selection,
};

static int stm32_dcmipp_enable_clock(const struct device *dev)
{
	const struct stm32_dcmipp_config *config = dev->config;
	const struct device *cc_node = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int err;

	if (config->has_dcmipp_ker) {
		err = clock_control_configure(cc_node,
					      (clock_control_subsys_t)&config->dcmipp_pclken_ker,
					      NULL);
		if (err < 0) {
			LOG_ERR("Failed to configure DCMIPP clock. Error %d", err);
			return err;
		}
	}

	/* Turn on DCMIPP peripheral clock */
	err = clock_control_on(cc_node, (clock_control_subsys_t)&config->dcmipp_pclken);
	if (err < 0) {
		LOG_ERR("Failed to enable DCMIPP clock. Error %d", err);
		return err;
	}

#if defined(STM32_DCMIPP_HAS_CSI)
	/* Turn on CSI peripheral clock */
	err = clock_control_on(cc_node, (clock_control_subsys_t)&config->csi_pclken);
	if (err < 0) {
		LOG_ERR("Failed to enable CSI clock. Error %d", err);
		return err;
	}
#endif

	return 0;
}

static int stm32_dcmipp_init(const struct device *dev)
{
	const struct stm32_dcmipp_config *cfg = dev->config;
	struct stm32_dcmipp_data *dcmipp = dev->data;

	int err;

	dcmipp->enabled_pipe = 0;

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	dcmipp->isp_dec_hratio = 1;
	dcmipp->isp_dec_vratio = 1;
#endif

	/* Configure DT provided pins */
	if (cfg->bus_type == VIDEO_BUS_TYPE_PARALLEL) {
		err = pinctrl_apply_state(cfg->pctrl, PINCTRL_STATE_DEFAULT);
		if (err < 0) {
			LOG_ERR("pinctrl setup failed. Error %d.", err);
			return err;
		}
	}

	/* Enable DCMIPP / CSI clocks */
	err = stm32_dcmipp_enable_clock(dev);
	if (err < 0) {
		LOG_ERR("Clock enabling failed.");
		return err;
	}

	/* Reset DCMIPP & CSI */
	if (!device_is_ready(cfg->reset_dcmipp.dev)) {
		LOG_ERR("reset controller not ready");
		return -ENODEV;
	}
	reset_line_toggle_dt(&cfg->reset_dcmipp);
#if defined(STM32_DCMIPP_HAS_CSI)
	reset_line_toggle_dt(&cfg->reset_csi);
#endif

