zephyrproject-rtos/zephyr/drivers/video/video_stm32_dcmipp.c
	dcmipp->dev = dev;

	/* Run IRQ init */
	cfg->irq_config(dev);

	/* Initialize DCMI peripheral */
	err = HAL_DCMIPP_Init(&dcmipp->hdcmipp);
	if (err != HAL_OK) {
		LOG_ERR("DCMIPP initialization failed.");
		return -EIO;
	}

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
	/* Check if source device is ready */
	if (!device_is_ready(cfg->source_dev)) {
		LOG_ERR("Source device not ready");
		return -ENODEV;
	}

	/*
	 * It is necessary to perform a dummy configuration here otherwise any
	 * ISP related configuration done by the stm32_dcmipp_isp_init will
	 * fail due to the HAL DCMIPP driver not being in READY state
	 */
	err = stm32_dcmipp_conf_parallel(dcmipp->dev, &stm32_dcmipp_input_fmt_desc[0]);
	if (err < 0) {
		LOG_ERR("Failed to perform dummy parallel configuration");
		return err;
	}

	err = stm32_dcmipp_isp_init(&dcmipp->hdcmipp, cfg->source_dev);
	if (err < 0) {
		LOG_ERR("Failed to initialize the ISP");
		return err;
	}

	stm32_dcmipp_get_isp_decimation(dcmipp);
#endif

	LOG_DBG("%s initialized", dev->name);

	return 0;
}

static int stm32_dcmipp_pipe_init(const struct device *dev)
{
	struct stm32_dcmipp_pipe_data *pipe = dev->data;
	struct stm32_dcmipp_data *dcmipp = pipe->dcmipp;

	k_mutex_init(&pipe->lock);
	k_fifo_init(&pipe->fifo_in);
	k_fifo_init(&pipe->fifo_out);

	/* Initialize format/crop/compose */
	pipe->fmt.type = VIDEO_BUF_TYPE_OUTPUT;
	pipe->fmt.width = dcmipp->source_fmt.width;
	pipe->fmt.height = dcmipp->source_fmt.height;
	pipe->fmt.pixelformat = dcmipp->source_fmt.pixelformat;
	pipe->crop.top = 0;
	pipe->crop.left = 0;
	pipe->crop.width = pipe->fmt.width;
	pipe->crop.height = pipe->fmt.height;
	pipe->compose = pipe->crop;

	/* Store the pipe data pointer into dcmipp data structure */
	dcmipp->pipe[pipe->id] = pipe;

	return 0;
}

static void stm32_dcmipp_isr(const struct device *dev)
{
	struct stm32_dcmipp_data *dcmipp = dev->data;

	HAL_DCMIPP_IRQHandler(&dcmipp->hdcmipp);
}

#if defined(STM32_DCMIPP_HAS_CSI) && defined(CONFIG_VIDEO_STM32_DCMIPP_CSI_ENABLE_IRQ)
static void stm32_dcmipp_csi_isr(const struct device *dev)
{
	struct stm32_dcmipp_data *dcmipp = dev->data;

	HAL_DCMIPP_CSI_IRQHandler(&dcmipp->hdcmipp);
}
#endif

#define SOURCE_DEV(inst) DEVICE_DT_GET(DT_NODE_REMOTE_DEVICE(DT_INST_ENDPOINT_BY_ID(inst, 0, 0)))

#define DCMIPP_PIPE_INIT_DEFINE(node_id, inst)						\
	static struct stm32_dcmipp_pipe_data stm32_dcmipp_pipe_##node_id = {		\
		.id = DT_NODE_CHILD_IDX(node_id),					\
		.dcmipp = &stm32_dcmipp_data_##inst,					\
	};										\
											\
	DEVICE_DT_DEFINE(node_id, &stm32_dcmipp_pipe_init, NULL,			\
			 &stm32_dcmipp_pipe_##node_id,					\
			 &stm32_dcmipp_config_##inst,					\
			 POST_KERNEL, CONFIG_VIDEO_STM32_DCMIPP_INIT_PRIORITY,			\
			 &stm32_dcmipp_driver_api);					\
											\
	VIDEO_DEVICE_DEFINE(dcmipp_##inst_pipe_##node_id, DEVICE_DT_GET(node_id), SOURCE_DEV(inst));

#if defined(STM32_DCMIPP_HAS_CSI)
#define STM32_DCMIPP_CSI_DT_PARAMS(inst)							\
		.csi_pclken = STM32_DT_INST_CLOCK_INFO_BY_NAME(inst, csi),			\
		.reset_csi = RESET_DT_SPEC_INST_GET_BY_IDX(inst, 1),				\
		.csi.nb_lanes = DT_PROP_LEN(DT_INST_ENDPOINT_BY_ID(inst, 0, 0), data_lanes),	\
		.csi.lanes[0] = DT_PROP_BY_IDX(DT_INST_ENDPOINT_BY_ID(inst, 0, 0),		\
					       data_lanes, 0),					\
		.csi.lanes[1] = COND_CODE_1(DT_PROP_LEN(DT_INST_ENDPOINT_BY_ID(inst, 0, 0),	\
							data_lanes),				\
					    (0),						\
					    (DT_PROP_BY_IDX(DT_INST_ENDPOINT_BY_ID(inst, 0, 0),	\
							    data_lanes, 1))),

#if defined(CONFIG_VIDEO_STM32_DCMIPP_CSI_ENABLE_IRQ)
#define STM32_DCMIPP_CSI_IRQ_INIT(inst)								\
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, dcmipp_csi, irq),				\
			    DT_INST_IRQ_BY_NAME(inst, dcmipp_csi, priority),			\
			    stm32_dcmipp_csi_isr, DEVICE_DT_INST_GET(inst), 0);			\
		irq_enable(DT_INST_IRQ_BY_NAME(inst, dcmipp_csi, irq));
#else
#define STM32_DCMIPP_CSI_IRQ_INIT(inst)
#endif

#else
#define STM32_DCMIPP_CSI_DT_PARAMS(inst)
#define STM32_DCMIPP_CSI_IRQ_INIT(inst)
#endif

#if defined(STM32_DCMIPP_HAS_PIXEL_PIPES)
#define STM32_DCMIPP_PIPES(inst) \
	DT_FOREACH_CHILD_VARGS(DT_INST_CHILD(inst, pipes), DCMIPP_PIPE_INIT_DEFINE, inst)
#else
#define STM32_DCMIPP_PIPE_INIT(node_id, inst) DCMIPP_PIPE_INIT_DEFINE(node_id, inst)
#define STM32_DCMIPP_PIPES(inst) STM32_DCMIPP_PIPE_INIT(DT_INST_CHILD(inst, pipe), inst)
#endif

#define STM32_DCMIPP_INIT(inst)									\
	static void stm32_dcmipp_irq_config_##inst(const struct device *dev)			\
	{											\
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, dcmipp, irq),				\
			    DT_INST_IRQ_BY_NAME(inst, dcmipp, priority),			\
			    stm32_dcmipp_isr, DEVICE_DT_INST_GET(inst), 0);			\
		irq_enable(DT_INST_IRQ_BY_NAME(inst, dcmipp, irq));				\
		STM32_DCMIPP_CSI_IRQ_INIT(inst)							\
	}											\
												\
	static struct stm32_dcmipp_data stm32_dcmipp_data_##inst = {				\
		.hdcmipp = {									\
			.Instance = (DCMIPP_TypeDef *)DT_INST_REG_ADDR(inst),			\
		},										\
		.source_fmt = {									\
			.pixelformat =								\
				VIDEO_FOURCC_FROM_STR(						\
						CONFIG_VIDEO_STM32_DCMIPP_SENSOR_PIXEL_FORMAT),	\
			.width = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_WIDTH,			\
			.height = CONFIG_VIDEO_STM32_DCMIPP_SENSOR_HEIGHT,			\
		},										\
	};											\
												\
	PINCTRL_DT_INST_DEFINE(inst);								\
												\
	static const struct stm32_dcmipp_config stm32_dcmipp_config_##inst = {			\
		.dcmipp_pclken = STM32_DT_INST_CLOCK_INFO_BY_NAME(inst, dcmipp),		\
		.dcmipp_pclken_ker = COND_CODE_1(DT_INST_CLOCKS_HAS_NAME(inst, dcmipp_ker),	\
				(STM32_DT_INST_CLOCK_INFO_BY_NAME(inst, dcmipp_ker)),	\
				({0})),							\
		.has_dcmipp_ker = DT_INST_CLOCKS_HAS_NAME(inst, dcmipp_ker),			\
		.irq_config = stm32_dcmipp_irq_config_##inst,					\
		.pctrl = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),					\
		.source_dev = SOURCE_DEV(inst),							\
		.reset_dcmipp = RESET_DT_SPEC_INST_GET_BY_IDX(inst, 0),				\
		.bus_type = DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(inst, 0, 0), bus_type,		\
				       VIDEO_BUS_TYPE_PARALLEL),				\
		STM32_DCMIPP_CSI_DT_PARAMS(inst)						\
		.parallel.vs_polarity = DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(inst, 0, 0),		\
						    vsync_active, 0) ?				\
						    DCMIPP_VSPOLARITY_HIGH :			\
						    DCMIPP_VSPOLARITY_LOW,			\
		.parallel.hs_polarity = DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(inst, 0, 0),	        \
						   hsync_active, 0) ?				\
						    DCMIPP_HSPOLARITY_HIGH :			\
						    DCMIPP_HSPOLARITY_LOW,			\
		.parallel.pck_polarity = DT_PROP_OR(DT_INST_ENDPOINT_BY_ID(inst, 0, 0),		\
						    pclk_sample, 0) ?				\
						    DCMIPP_PCKPOLARITY_RISING :			\
						    DCMIPP_PCKPOLARITY_FALLING,			\
	};											\
												\
	DEVICE_DT_INST_DEFINE(inst, &stm32_dcmipp_init,						\
		    NULL, &stm32_dcmipp_data_##inst,						\
		    &stm32_dcmipp_config_##inst,						\
		    POST_KERNEL, CONFIG_VIDEO_STM32_DCMIPP_INIT_PRIORITY,			\
		    NULL);									\
												\
	STM32_DCMIPP_PIPES(inst)

DT_INST_FOREACH_STATUS_OKAY(STM32_DCMIPP_INIT)
